# -*- coding:utf-8 -*-
import os
import jieba
from jieba import analyse

list = ['出租车', '打车', '打的', '的士站', '的士', '公共汽车', '公交', '佛山', '南海', '顺德', '停车场', '长途汽车站', '汽车站', '地铁', '二号线', '七号线', '候车厅', '坐车', '取票', '打印车票', '买票', '购票', '售票', '改签，退票', '取不了票', '取不到票', '人工', '怎么退', '退了', '身份证丢了', '身份证忘带', '临时身份证', '便利店', '商店', '小卖铺', '买水', '买吃的', '买东西', '换零钱', '7-11', '71', '美宜佳', '喜士多', '全家', '利口福', '餐厅', '快餐店', '吃饭', '餐饮店', '有饭吃', '饭店', '洗手间', '卫生间', '厕所', '方便', '残疾人卫生间', '行李寄存', '行李托运', '存包', '寄存', '托运', '包', '箱子', '没电', '借充电宝', '充电', '充电宝', '公用电话', '港币，澳门币，人民币', '微信', '支付宝', '刷卡', '广州火车站', '广州站', '老火车站', '广州东站', '东站', '广州北站', '北站', '花都火车站', '庆盛站', '庆盛火车站', '机场', '白云机场', '白云国际机场', '一号航站楼', '二号航站楼', 'T1航站楼', 'T2航站楼', '省汽车客运站', '省汽车站', '省站', '市汽车站', '市站', '天河客运站', '海珠客运站', '芳村客运站', '广州塔', '大学城', '珠江新城', '长隆', '长隆飞鸟乐园', '中山大学', '中大', 'wifi']

print(len(list))
print(len(set(list)))

s = "便利店能还充电宝吗"

# list = analyse.extract_tags(s, 20, withWeight=True)    # 分词，根据TF-IDF找出前20个关键字
# print("TF*IDF后：", list)
# for s in list:
#     print(s[0], s[1])
#
# list1 = analyse.textrank(s, 20, withWeight=True)    # 分词，根据textrank# 找出前20个关键字
# print("TextRank后：", list1)

# words = jieba.cut(s)
#
# liststr = "/ ".join(words)
# print("jieba分词后：", liststr)

# s = "../testData/demo.pcm"
#
# print(s[s.rindex("/")+1:].replace(".", "_")+".wav")

dict = {}

dict["zhangsan"] = dict.get("zhangsan") + "lisi"

print(dict)